In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('StudentsPerformance.csv')

In [3]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

# 1. Find out how many males and females participated in the test.

In [40]:
df['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [41]:
#There are 518 Female and 482 Males participated ih the test

# 2. What do you think about the students' parental level of education?

In [6]:
df2=df['parental level of education'].value_counts()

In [8]:
df2=df2.to_frame()

In [11]:
df2.columns=['count of parental level of education']
df2

                    count of parental level of education
some college                                         226
associate's degree                                   222
high school                                          196
some high school                                     179
bachelor's degree                                    118
master's degree                                       59

In [45]:
df3 = df2.apply(lambda x:100 * x / float(x.sum()))
df3.columns=['Parental level education percentage']
df3

                    Parental level education percentage
some college                                       22.6
associate's degree                                 22.2
high school                                        19.6
some high school                                   17.9
bachelor's degree                                  11.8
master's degree                                     5.9

In [ ]:
#From the above we can see that 5.9% of parents have the highest qualification Master degree.

# 3.1 Who scores the most on average for math, reading and writing based on Gender

In [57]:
df.groupby(['gender'])[['math score','reading score','writing score']].mean()

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [70]:
#For Maths Males,reading and writing Female Scored the most.

# 3.2 Who scores the most on average for math, reading and writing based on Test preparation course

In [60]:
df.groupby(['test preparation course'])[['math score','reading score','writing score']].mean()

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [ ]:
#Test preparation course completed persons are scored well in all category.

# 4.1 What do you think about the scoring variation for math, reading and writing based on gender

In [61]:
df.groupby(['gender'])[['math score','reading score','writing score']].var()

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [71]:
#Less variation are in male students scores.

# 4.2 What do you think about the scoring variation for math, reading and writing based on Test preparation course

In [63]:
df.groupby(['test preparation course'])[['math score','reading score','writing score']].var()

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

In [72]:
#Less score variations are shown in students who completed the preparation course

# 5. The management needs your help to give bonus points to the top 25% of students based on their maths score, so how will you help the management to achieve this.

In [ ]:
#Total 1000 students are there.25% of 1000 is 250 number's.

In [69]:
df.sort_values('math score', ascending=False).nlargest(250,"math score")

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100
996,male,group A,some college,standard,completed,100,96,86
515,female,group E,some college,standard,none,100,92,97
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
...,...,...,...,...,...,...,...,...
856,male,group E,some high school,standard,completed,77,76,77
855,male,group E,associate's degree,free/reduced,completed,77,69,68
854,male,group D,some high school,standard,completed,77,68,69
853,male,group D,associate's degree,free/reduced,none,77,78,73
852,male,group D,some college,free/reduced,none,77,62,64